const categories = [
  {
    name: "Разное",
    questions: [
      {
        text: "Продолжите фразу Lorem ipsum ...",
        answer: "Dolor"
      },
      {
        text:
          "Назовите короткое название организации 'Консорциум Всемирной Паутины'",
        answer: "W3C"
      },
      {
        text: "Дословный перевод этого инструмента для тестирования — кукловод",
        answer: "Puppeteer"
      },
      {
        cat: true,
        text:
          "Этот код изначально использовался в автомобильной промышленности",
        answer: "QR-код"
      }
    ]
  },
  {
    name: "Люди",
    questions: [
      {
        text: "Назовите имя и фамилию первого докладчика",
        answer: "Сергей Бутузов"
      },
      {
        text:
          "У этого эпотажного фронтендера есть традиционная пятничная рубрика 18+ в соцсетях",
        answer: "Андрей Ситник"
      },
      {
        text: 'Назовите имя "постоянного ведущего" подкаста Веб-стандарты',
        answer: "Вадим Макеев"
      },
      {
        text:
          "Именем какого иллюзиониста названа технология, позволяющая расширять возможности CSS",
        answer: "Гари Гудини"
      }
    ]
  },
  {
    name: "Верстка",
    questions: [
      {
        text: "С января 2020 года этот браузер перешел на Chromium",
        answer: "Edge"
      },
      {
        text: "Это слово обозначает M в HTML",
        answer: "Markup"
      },
      {
        text:
          "Одна из популярных шуток про CSS — картинка, на которой текст не умещается в контейнере и выходит за границы. Назовите фразу полностью",
        answer: "CSS IS AWESOME"
      },
      {
        text:
          "Этот цвет может быть написан в британском и амерканском стиле. А в шестнадцатеричной записи, кажется, что он дразнится — #bebebe",
        answer: "gray / grey"
      }
    ]
  },
  {
    name: "JS",
    questions: [
      {
        text: "Этим словом можно приостановить выполнение JS кода",
        answer: "debugger"
      },
      {
        text: "Этот тип данных при проверке претворяется другим",
        answer: "null"
      },
      {
        text:
          "Релизы этого проекта обозначаются названиями элементов таблицы Менделеева",
        answer: "Node.js"
      },
      {
        auction: true,
        text:
          "С недавнего времени можно стать сертифицированным специалистом по этой технологии",
        answer: "Node.js"
      }
    ]
  }
];
