const categories = [
  {
    name: "стандарты",
    questions: [
      {
        text:
          "При разработки очередной спецификации, она проходит несколько стадий. Назовите количество",
        answer: "5"
      },
      {
        text:
          "Какой порядкой номер редакции ECMAScript был выпущен в 2019 году",
        answer: "10"
      },
      {
        cat: true,
        text:
          "Этот код изначально использовался в автомобильной промышленности.",
        answer: "QR-код"
      },
      {
        text:
          "На сегодняшний день существует две спецификации HTML от двух разных организаций. Назовите обе",
        answer: "WHATWG и W3C"
      }
    ]
  },
  {
    name: "Люди",
    questions: [
      {
        text:
          "Преждевременная оптимизация — корень всех зол. Назовите автора фразы",
        answer: "Дональд Кнут"
      },
      {
        text:
          "Как звали персонажа из популярной детской книги про компьютеры 1991 года?",
        answer: "Профессор Фортран"
      },
      {
        text: "Назовите имя постоянного ведущего подкаста Веб стандарты",
        answer: "Вадим Макеев"
      },
      {
        text:
          "В честь какого иллюзиониста названа одна технология, позволяющая расширять возможности CSS",
        answer: "Гари Гудини"
      }
    ]
  },
  {
    name: "Верстка",
    questions: [
      {
        text:
          "Этот фрейморк от компании Google состоит из веб-компонентов и предназначен для ускорения загрузки страниц",
        answer: "AMP"
      },
      {
        text:
          "Этот цвет имеет может быть написан в британском и амерканском стиле. А в шестнадцатеричной записи, кажется, что он дразнится — #bebebe",
        answer: "gray / grey"
      },
      {
        text: "В чем разница между reset.css и normilize.css",
        answer:
          "Reset.css сбрасывает все стили. Normilize.css делает все дефолтные стили одинаковыми"
      },
      {
        text: "Маскотом этого популярного Open Source проекта является ёжик",
        answer: "Browserlist"
      }
    ]
  },
  {
    name: "JS",
    questions: [
      {
        text: 'Прямой перевод этого ключего слова  — "уступать"',
        answer: "yield"
      },
      {
        text:
          "Релизы этого проекта обозначаются названиями элементов таблицы Менделеева",
        answer: "Node.js"
      },
      {
        text: "Сколько времени по утверждению автора ушло на создание JS?",
        answer: "10 дней"
      },
      {
        auction: true,
        text:
          "Создатель X, назвал своё детище ошибкой на миллиард долларов. Назовите X",
        answer: "NULL"
      }
    ]
  }
];
