const categories = [
  {
    name: "стандарты",
    questions: [
      {
        text:
          "Процесс разработки спецификации в TC39 состоит из нескольких стадий. Назовите их количество",
        answer: "5"
      },
      {
        text:
          "Какой номер редакции имеет спецификация ECMAScript, которая была выпущена в 2019 году",
        answer: "10"
      },
      {
        cat: true,
        text:
          "Этот код изначально использовался в автомобильной промышленности",
        answer: "QR-код"
      },
      {
        text:
          "На сегодняшний день существует две спецификации HTML от двух разных организаций. Назовите обе организации",
        answer: "WHATWG и W3C"
      }
    ]
  },
  {
    name: "Персонажи",
    questions: [
      {
        text:
          '"Преждевременная оптимизация — корень всех зол". Назовите автора знаменитой фразы',
        answer: "Дональд Кнут"
      },
      {
        text:
          "Как звали главного персонажа популярной детской книги про компьютеры 1991 года, действие которой происходит в городе Симплексе?",
        answer: "Профессор Фортран"
      },
      {
        text: "Назовите имя \"постоянного ведущего\" подкаста Веб-стандарты",
        answer: "Вадим Макеев"
      },
      {
        text:
          "В честь какого иллюзиониста названа технология, позволяющая расширять возможности CSS",
        answer: "Гари Гудини"
      }
    ]
  },
  {
    name: "Верстка",
    questions: [
      {
        text:
          "Этот фрейморк от компании Google состоит из веб-компонентов и предназначен для ускорения загрузки страниц",
        answer: "AMP"
      },
      {
        text:
          "Этот цвет имеет может быть написан в британском и амерканском стиле. А в шестнадцатеричной записи, кажется, что он дразнится — #bebebe",
        answer: "gray / grey"
      },
      {
        text: "В чем разница между reset.css и normilize.css",
        answer:
          "Reset.css сбрасывает все стили. Normilize.css делает все дефолтные стили одинаковыми"
      },
      {
        text: "Маскотом этого популярного Open Source проекта является ёжик",
        answer: "Browserlist"
      }
    ]
  },
  {
    name: "JS",
    questions: [
      {
        text: 'Прямой перевод этого ключего слова  — "уступать"',
        answer: "yield"
      },
      {
        text:
          "Релизы этого проекта обозначаются названиями элементов таблицы Менделеева",
        answer: "Node.js"
      },
      {
        text: "Сколько времени по утверждению автора ушло на создание JS?",
        answer: "10 дней"
      },
      {
        auction: true,
        text:
          "Создатель X, назвал своё детище ошибкой на миллиард долларов. Назовите X",
        answer: "NULL"
      }
    ]
  }
];
